app/controllers/photos_controller.rb

SELECT "photos".* FROM "photos" ORDER BY RANDOM() LIMIT 1
---
  def index
    @photos = Photo.all