app/controllers/ratings_controller.rb

  def new
    @photo = Photo.all.sample
---
SELECT "photos".* FROM "photos" ORDER BY RANDOM() LIMIT 1